app/controllers/school_classes_controller.rb

  def update
    set_school_class
    @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Scienc"], ["room_number", 12], ["updated_at", "2021-07-04 04:47:15.670068"], ["id", 1]]